logs_pics/stage2/wrkLogsGet.txt
Running 15s test @ http://localhost:8080
  1 threads and 17 connections
  Thread calibration: mean lat.: 1.166ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.15ms  503.35us   5.05ms   63.92%
    Req/Sec     2.11k   135.10     2.56k    78.69%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.11ms
 75.000%    1.52ms
 90.000%    1.82ms
 99.000%    2.29ms
 99.900%    2.81ms
 99.990%    4.82ms
 99.999%    5.05ms
100.000%    5.05ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.181     0.000000            1         1.00
       0.492     0.100000          990         1.11
       0.671     0.200000         1968         1.25
       0.826     0.300000         2954         1.43
       0.968     0.400000         3932         1.67
       1.110     0.500000         4919         2.00
       1.194     0.550000         5408         2.22
       1.279     0.600000         5903         2.50
       1.355     0.650000         6394         2.86
       1.431     0.700000         6886         3.33
       1.519     0.750000         7376         4.00
       1.563     0.775000         7621         4.44
       1.606     0.800000         7871         5.00
       1.655     0.825000         8111         5.71
       1.704     0.850000         8356         6.67
       1.759     0.875000         8601         8.00
       1.789     0.887500         8724         8.89
       1.823     0.900000         8848        10.00
       1.860     0.912500         8969        11.43
       1.895     0.925000         9094        13.33
       1.936     0.937500         9218        16.00
       1.960     0.943750         9278        17.78
       1.982     0.950000         9339        20.00
       2.009     0.956250         9400        22.86
       2.038     0.962500         9461        26.67
       2.073     0.968750         9525        32.00
       2.087     0.971875         9553        35.56
       2.105     0.975000         9584        40.00
       2.137     0.978125         9614        45.71
       2.165     0.981250         9645        53.33
       2.203     0.984375         9676        64.00
       2.219     0.985938         9692        71.11
       2.253     0.987500         9708        80.00
       2.273     0.989062         9723        91.43
       2.305     0.990625         9737       106.67
       2.335     0.992188         9753       128.00
       2.345     0.992969         9760       142.22
       2.381     0.993750         9768       160.00
       2.411     0.994531         9777       182.86
       2.431     0.995313         9783       213.33
       2.453     0.996094         9791       256.00
       2.493     0.996484         9795       284.44
       2.537     0.996875         9799       320.00
       2.557     0.997266         9803       365.71
       2.627     0.997656         9806       426.67
       2.647     0.998047         9810       512.00
       2.665     0.998242         9812       568.89
       2.729     0.998437         9814       640.00
       2.735     0.998633         9816       731.43
       2.801     0.998828         9818       853.33
       2.825     0.999023         9820      1024.00
       2.901     0.999121         9821      1137.78
       2.925     0.999219         9822      1280.00
       2.987     0.999316         9823      1462.86
       3.265     0.999414         9824      1706.67
       3.589     0.999512         9825      2048.00
       3.589     0.999561         9825      2275.56
       3.619     0.999609         9826      2560.00
       3.619     0.999658         9826      2925.71
       3.939     0.999707         9827      3413.33
       3.939     0.999756         9827      4096.00
       3.939     0.999780         9827      4551.11
       4.823     0.999805         9828      5120.00
       4.823     0.999829         9828      5851.43
       4.823     0.999854         9828      6826.67
       4.823     0.999878         9828      8192.00
       4.823     0.999890         9828      9102.22
       5.055     0.999902         9829     10240.00
       5.055     1.000000         9829          inf
#[Mean    =        1.146, StdDeviation   =        0.503]
#[Max     =        5.052, Total count    =         9829]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%  307.00us
 75.000%  413.00us
 90.000%  539.00us
 99.000%  756.00us
 99.900%    0.95ms
 99.990%    1.10ms
 99.999%    1.11ms
100.000%    1.11ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.065     0.000000            1         1.00
       0.188     0.100000          984         1.11
       0.223     0.200000         1969         1.25
       0.244     0.300000         2989         1.43
       0.266     0.400000         3937         1.67
       0.307     0.500000         4927         2.00
       0.326     0.550000         5407         2.22
       0.345     0.600000         5910         2.50
       0.364     0.650000         6403         2.86
       0.385     0.700000         6887         3.33
       0.413     0.750000         7379         4.00
       0.428     0.775000         7621         4.44
       0.449     0.800000         7877         5.00
       0.472     0.825000         8116         5.71
       0.493     0.850000         8364         6.67
       0.515     0.875000         8605         8.00
       0.526     0.887500         8732         8.89
       0.539     0.900000         8855        10.00
       0.553     0.912500         8969        11.43
       0.568     0.925000         9095        13.33
       0.582     0.937500         9216        16.00
       0.591     0.943750         9277        17.78
       0.599     0.950000         9339        20.00
       0.612     0.956250         9402        22.86
       0.631     0.962500         9462        26.67
       0.649     0.968750         9522        32.00
       0.660     0.971875         9553        35.56
       0.669     0.975000         9585        40.00
       0.682     0.978125         9616        45.71
       0.701     0.981250         9645        53.33
       0.716     0.984375         9676        64.00
       0.727     0.985938         9694        71.11
       0.734     0.987500         9707        80.00
       0.745     0.989062         9723        91.43
       0.765     0.990625         9737       106.67
       0.779     0.992188         9753       128.00
       0.787     0.992969         9761       142.22
       0.797     0.993750         9768       160.00
       0.809     0.994531         9776       182.86
       0.824     0.995313         9783       213.33
       0.844     0.996094         9791       256.00
       0.854     0.996484         9795       284.44
       0.882     0.996875         9799       320.00
       0.888     0.997266         9803       365.71
       0.895     0.997656         9806       426.67
       0.918     0.998047         9810       512.00
       0.930     0.998242         9812       568.89
       0.934     0.998437         9814       640.00
       0.936     0.998633         9816       731.43
       0.947     0.998828         9818       853.33
       0.965     0.999023         9820      1024.00
       0.976     0.999121         9821      1137.78
       0.992     0.999219         9822      1280.00
       0.996     0.999316         9823      1462.86
       0.998     0.999414         9824      1706.67
       1.013     0.999512         9825      2048.00
       1.013     0.999561         9825      2275.56
       1.017     0.999609         9826      2560.00
       1.017     0.999658         9826      2925.71
       1.090     0.999707         9827      3413.33
       1.090     0.999756         9827      4096.00
       1.090     0.999780         9827      4551.11
       1.095     0.999805         9828      5120.00
       1.095     0.999829         9828      5851.43
       1.095     0.999854         9828      6826.67
       1.095     0.999878         9828      8192.00
       1.095     0.999890         9828      9102.22
       1.114     0.999902         9829     10240.00
       1.114     1.000000         9829          inf
#[Mean    =        0.337, StdDeviation   =        0.141]
#[Max     =        1.114, Total count    =         9829]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  29926 requests in 15.00s, 1.86MB read
Requests/sec:   1995.01
Transfer/sec:    126.64KB